<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"e1eb4f782038d3c7a24b0c1d077d1b7b4cc1d233526c4289fa93ae719fec81e2","plan_job_ref":"Job terraform plan #102 at https://github.com/suzutan/infra/actions/runs/15093791640","plan_out_hash":"ca6f916ba7ac912c0d3e65072f0723a030357cb896bf9d82f4e306bd5f0ca513","plan_hash":"3a3ac8b2ccfa9ebf81514dd8f9913f2d58458be362a4c34055fdf1935a8b2b41","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __terraform/suzutan.jp__
<details>
<summary>Plan: 0 to add, 6 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudflare_dns_record.atria will be updated in-place
!~  resource "cloudflare_dns_record" "atria" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      created_on          = "2025-03-09T15:29:11Z" -> (known after apply)
        id                  = "5c2bd30962c7b1f013b9dd3eacb33356"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-05-16T08:12:45Z" -> (known after apply)
!~      name                = "atria.suzutan.jp" -> "atria"
!~      proxiable           = true -> (known after apply)
!~      settings            = {
+           flatten_cname = (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
!~      tags                = [] -> (known after apply)
+       tags_modified_on    = (known after apply)
#        (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.bluesky_site_verification will be updated in-place
!~  resource "cloudflare_dns_record" "bluesky_site_verification" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      created_on          = "2025-03-09T15:29:11Z" -> (known after apply)
        id                  = "e895419ec0a8ee15e34fbc09adf0e58f"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-03-09T15:29:11Z" -> (known after apply)
!~      name                = "_atproto.suzutan.jp" -> "_atproto"
!~      proxiable           = false -> (known after apply)
!~      settings            = {
+           flatten_cname = (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
!~      tags                = [] -> (known after apply)
+       tags_modified_on    = (known after apply)
#        (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.osk_nw will be updated in-place
!~  resource "cloudflare_dns_record" "osk_nw" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      created_on          = "2025-03-09T15:29:11Z" -> (known after apply)
        id                  = "3bf9b747c9c154c527790ecf3a54fdd1"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-03-09T15:29:11Z" -> (known after apply)
!~      name                = "osk.nw.suzutan.jp" -> "osk.nw"
!~      proxiable           = false -> (known after apply)
!~      settings            = {
+           flatten_cname = (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
!~      tags                = [] -> (known after apply)
+       tags_modified_on    = (known after apply)
#        (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.rt_osk_nw will be updated in-place
!~  resource "cloudflare_dns_record" "rt_osk_nw" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      created_on          = "2025-03-09T15:29:11Z" -> (known after apply)
        id                  = "e65f8dd460b681cc4b40c1374b46fa3a"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-03-09T15:29:11Z" -> (known after apply)
!~      name                = "rt.osk.nw.suzutan.jp" -> "rt.osk.nw"
!~      proxiable           = false -> (known after apply)
!~      settings            = {
+           flatten_cname = (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
!~      tags                = [] -> (known after apply)
+       tags_modified_on    = (known after apply)
#        (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.silverstone_osk_nw will be updated in-place
!~  resource "cloudflare_dns_record" "silverstone_osk_nw" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      created_on          = "2025-03-09T15:29:12Z" -> (known after apply)
        id                  = "43b42c6197c284982da97f6989ce6318"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-03-09T15:29:12Z" -> (known after apply)
!~      name                = "silverstone.osk.nw.suzutan.jp" -> "silverstone.osk.nw"
!~      proxiable           = false -> (known after apply)
!~      settings            = {
+           flatten_cname = (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
!~      tags                = [] -> (known after apply)
+       tags_modified_on    = (known after apply)
#        (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.spica will be updated in-place
!~  resource "cloudflare_dns_record" "spica" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      created_on          = "2025-03-09T15:29:12Z" -> (known after apply)
        id                  = "f4153b36a6b37bbe6b09ca359e51f7bd"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-05-16T08:12:45Z" -> (known after apply)
!~      name                = "spica.suzutan.jp" -> "spica"
!~      proxiable           = true -> (known after apply)
!~      settings            = {
+           flatten_cname = (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
!~      tags                = [] -> (known after apply)
+       tags_modified_on    = (known after apply)
#        (5 unchanged attributes hidden)
    }

Plan: 0 to add, 6 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [terraform plan #102](https://github.com/suzutan/infra/actions/runs/15093791640)